app/views/receipt_mailer/receipt_email.html.erb

      <ul>
      <% @order.line_items.each do |line_item| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 22]]