app/controllers/admin/categories_controller.rb

  def index
    @categories = Category.order(id: :desc).all
---
SELECT "categories".* FROM "categories"  ORDER BY "categories"."id" DESC