app/views/orders/_line_item.html.erb

<% if product = Product.find_by(id: product_id) %>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 16]]