app/views/orders/show.html.erb

SELECT "line_items".* FROM "line_items" WHERE (9)
---
        <% @order_total = 0 %>
        <% @order.line_items.each do |line_item| %>