app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("product_id", "user_id", "description", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["product_id", 11], ["user_id", 1], ["description", "SUCKS"], ["rating", 1], ["created_at", "2017-08-04 00:32:17.651954"], ["updated_at", "2017-08-04 00:32:17.651954"]]
---
  def create
    @newReview = Review.new(product_id: params[:product_id], user_id: current_user.id, description: params[:review]["description"], rating: params[:review]["rating"])
    if @newReview.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 34]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 34]]
---
  def destroy
    @review = Review.find params[:id]
    @review.destroy