app/views/products/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
---
        <dl class="dl-horizontal">
          <dt><%= "#{review.user.first_name} #{review.user.last_name}" %></dt>